---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainSurfaceshape
source: html/df66deb1-7d0c-363c-5682-c9ab8e9679e7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainSurfaceshape Property

"Surface Shape"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldMainSurfaceshape { get; }
```